Конфигурация отчетов/Documents/Переучеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Переучеты</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отдел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОтбораКухни</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБлюдКухня</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОтбораБар</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБлюдБар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сырье</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПФ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ед</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сырье</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПФ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ед</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Enums/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Склады</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кухня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хозтовары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уголь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Catalogs/ТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТМЦ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьИзПереучета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принадлежность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Documents/Переучеты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура АвтоЗапись()
	Записать();	
КонецПроцедуры




&НаСервере
Процедура ЗагрузитьНаСервере()
	ФайлДБФ = Новый XBase;
	
	ФайлДБФ.ОткрытьФайл("C:\temp\ShbdB\VvodO.DBF");
	
	Пока ФайлДБФ.ВКонце() = Ложь Цикл
		КодТМЦ = Число(ФайлДБФ.COD);  //Формат(ФайлДБФ.CODTMC, "ЧРГ=' '");
		НайденныйТМЦ = Справочники.ТМЦ.НайтиПоКоду(КодТМЦ);
		НовыйТМЦ = Объект.СписокТоваров.Добавить();
		НовыйТМЦ.Сырье = НайденныйТМЦ;
		НовыйТМЦ.Ед = НайденныйТМЦ.ЕД; 
		ФайлДБФ.Следующая();
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокТоваровПриИзмененииНаСервере()
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриИзменении(Элемент)
	СписокТоваровПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Элементы.СписокТоваров.Колич
	//// Вставити вміст обробника.
	//Элементы.СписокТоваровКоличество.АктивизироватьПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзСпрНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТМЦ.Ссылка КАК Ссылка,
		|	ТМЦ.Родитель.Наименование КАК РодительНаименование,
		|	ТМЦ.ЭтоГруппа КАК ЭтоГруппа,
		|	ТМЦ.ЕД КАК ЕД,
		|	ТМЦ.ИсключитьИзПереучета КАК ИсключитьИзПереучета,
		|	ТМЦ.Принадлежность КАК Принадлежность
		|ИЗ
		|	Справочник.ТМЦ КАК ТМЦ
		|ГДЕ
		|	ТМЦ.ЭтоГруппа = &ЭтоГруппа
		|	И ТМЦ.ИсключитьИзПереучета = &ИсключитьИзПереучета
		|	И ТМЦ.Принадлежность = &Принадлежность";
	
	Запрос.УстановитьПараметр("ИсключитьИзПереучета", Ложь);
	Запрос.УстановитьПараметр("ЭтоГруппа", Ложь);
	Запрос.УстановитьПараметр("Принадлежность", Объект.Отдел.Принадлежность);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Товар = Объект.СписокТоваров.Добавить();
		Товар.Сырье = Выборка.Ссылка;
		Товар.Ед = Выборка.ЕД;
		Товар.Группа = Выборка.РодительНаименование;
	КонецЦикла;
	
	Записать();
	Сообщить("Товар загружен в список!");	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзСпр(Команда)
	ЗагрузитьИзСпрНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаОтбораПриИзмененииНаСервере()
	//записываем значения в таблицу
	Для Каждого ТМЦОтбор Из Объект.СписокОтбора Цикл
		Для Каждого ТМЦ Из Объект.СписокТоваров Цикл
			Если ТМЦ.Сырье = ТМЦОтбор.Сырье Тогда
				ТМЦ.Количество = ТМЦОтбор.Количество;	
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	//выводим новый список
	Объект.СписокОтбора.Очистить();
	Для Каждого ТМЦ Из Объект.СписокТоваров Цикл
		Если Объект.Отдел.Принадлежность = Перечисления.Склады.Кухня Тогда
			НазваниеГруппы = Строка(Объект.ГруппаОтбораКухни);
		ИначеЕсли Объект.Отдел.Принадлежность = Перечисления.Склады.Бар Тогда
			НазваниеГруппы = Строка(Объект.ГруппаОтбораБар);
		КонецЕсли;
		Если СокрЛП(ТМЦ.Группа) = НазваниеГруппы Тогда
			Отбор = Объект.СписокОтбора.Добавить();
			Отбор.Сырье = ТМЦ.Сырье;
			Отбор.Ед = ТМЦ.Ед;
			Отбор.Количество = ТМЦ.Количество;
		КонецЕсли;
	КонецЦикла;	
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтбораПриИзменении(Элемент)
	ГруппаОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокОтбораПриИзмененииНаСервере()
	 АвтоЗапись();
КонецПроцедуры

&НаКлиенте
Процедура СписокОтбораПриИзменении(Элемент)
	СписокОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокОтбораКоличествоПриИзмененииНаСервере()
	АвтоЗапись();
КонецПроцедуры


Функция ПолучениеСклада()
	Если Объект.Отдел.Принадлежность = Перечисления.Склады.Бар Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
		
КонецФункции

Функция ПроверкаЗаполнения()
	Если Объект.Отдел.Пустая() Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СписокОтбораКоличествоПриИзменении(Элемент)
	СписокОтбораКоличествоПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура РедактированиеФормы()
	Если ПроверкаЗаполнения() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПолучениеСклада() = Истина Тогда
		Элементы.ГруппаОтбораКухни.Видимость = Ложь;
		Элементы.ГруппаОтбораБар.Видимость = Истина;

	Иначе
		Элементы.ГруппаОтбораБар.Видимость = Ложь;
		Элементы.ГруппаОтбораКухни.Видимость = Истина;

	КонецЕсли;	
	АвтоЗапись();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РедактированиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	РедактированиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	РедактированиеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтбораБарПриИзменении(Элемент)
	ГруппаОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОтбораКухниПриИзменении(Элемент)
	ГруппаОтбораПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаведениеПриИзменении(Элемент)
	АвтоЗапись();
КонецПроцедуры
